const create = () => {
  return (
    <>
      <h1>راهنمای ایجاد چت‌بات در وب‌سایت</h1>

      <section>
        <h2>۱. ثبت‌نام در سایت</h2>
        <p>ابتدا <a href="/Login">وارد سایت شوید</a> و حساب کاربری خود را ایجاد کنید.</p>
      </section>

      <section>
        <h2>۲. اضافه کردن چت‌بات</h2>
        <p>پس از ورود به پنل، روی دکمه <strong>افزودن چت‌بات</strong> کلیک کنید.</p>
      </section>

      <section>
        <h2>۳. وارد کردن اطلاعات چت‌بات</h2>
        <ul>
          <li>نام چت‌بات</li>
          <li>نام شرکت</li>
          <li>آموزش چت‌بات</li>
          <li>و سایر اطلاعات مورد نیاز</li>
        </ul>
      </section>

      <section>
        <h2>۴. ایجاد چت‌بات</h2>
        <p>
          پس از وارد کردن اطلاعات، یک چت‌بات جدید ایجاد می‌شود. با استفاده از دکمه 
          <strong>کپی توکن</strong> می‌توانید توکن چت‌بات را کپی کنید و از آن در روش‌های مختلف استفاده کنید:
        </p>
        <ul>
          <li>صحبت با چت‌بات برای بررسی پاسخ‌ها و تنظیمات</li>
          <li>استفاده از آن در API ما</li>
        </ul>
      </section>

      <section>
        <h2>۵. مستندات API</h2>
        <p>
          برای یادگیری چگونگی استفاده از چت بات ها به صورت api <a href="/docs/chat-bot/api">اینجا</a> را کلیک کنید.
        </p>
      </section>
    </>
  )
}

export default create
