import { A } from "@solidjs/router"

const create = () => {
  return (
    <>
      <h1>راهنمای ایجاد چت‌بات در وب‌سایت</h1>

      <ol>
        <li>
          با استفاده از لینک سفارش چت‌بات وارد صفحه ساخت چت‌بات جدید شوید.
        </li>
        <li>
          شماره تلفن همراه خود را وارد کنید، و کد تایید sms شده را وارد کنید.
        </li>
        <li>
          اطلاعات مربوط به ربات هوشمند خود از قبیل نام، و اطلاعاتی که میخواهید در اختیار کاربران خود قرار دهید را وارد کنید.
        </li>
        <li>
          حالا میتوانید به روش های مختلفی از جمله <a href="telegram">تلگرام</a>, <a href="widget">ویجت</a> و <a href="api">api</a> از ربات هوشمند خود استفاده کنید!
        </li>
      </ol>

      <b>
        <A href="/Place-Order/Chatbot">
          لینک ساخت چت‌بات جدید
        </A>
      </b>
    </>
  )
}

export default create
