import { A } from "@solidjs/router";

const create = () => {

  return (
    <>
      <h1>آموزش اتصال چت‌بات هوشمند به ربات تلگرام</h1>
      <ol>
        <li>
          قبل از هرچیز باید یک دستیار هوشمند (چت‌بات) خود را ساخته باشید. 
          <A href="/Docs/chat-bot/create">آموزش ساخت چت‌بات</A>
        </li>
        <li>
          سپس در 
          <A href="/Panel/Chatbot">پنل کاربری </A>
          خود گزینه 
          <strong>دریافت توکن </strong>
          را انتخاب کنید. توکن دریافت شده را نگه دارید.
        </li>
        <li>
          سپس با مراجعه به  BotFather تلگرام اقدام به ساخت یک ربات تلگرام کنید.
        </li>
        <li>
          توکن ربات تلگرام خود را دریافت کنید و نگه دارید.
        </li>
        <li>
          سپس در 
          <A href="/Panel/Chatbot">پنل کاربری </A>
          گزینه
          <strong> اتصال به تلگرام </strong>
          را انتخاب نمایید
        </li>
        <li>
          در صفحه باز شما دو کادر وجود دارد. به ترتیب، توکنی که از ربات تلگرام خود دریافت کرده اید, و توکن مربوط به 
          چت‌بات خود را وارد کنید.
        </li>
        <li>
          اتصال دستیار هوشمند شما با ربات تلگرامی برقرار است! حال میتواند از این ربات تلگرامی برای
          ارتباط با دستیار هوشمند خود استفاده کنید.
        </li>
      </ol>
      <p>
        در صورتی که با مشکل مواجه شدید میتوانید با <A href="/ContactUs">پشتیبانی</A> تماس بگیرید.
      </p>
    </>
  );
}

export default create
