const adjectives = [
  "آبی", "زرین", "نقره‌ای", "طلایی", "سایه‌ای", "تند", "آرام", "پنهان",
  "سریع", "پرنور", "براق", "خاکستری", "مه‌آلود", "کبود", "صخره‌ای", "آتشین", "برفی",
  "یخی", "آسمانی", "شبانه", "صبحگاهی", "دریایی", "کوچ‌رو", "کوهستانی", "بی‌صدا", "گوش‌به‌زنگ",
  "چابک", "وحشی", "باشکوه", "دلیر", "صبور", "پیچاپیچ", "بادخیز", "گردبادی", "برنده", "سنگی", "سایه‌گون", "افسانه‌ای",
  "رازآلود", "خاموش", "ناآشنا", "شجاع", "گریزان", "جست‌وخیزان", "تابناک", "کهن", "نو", "آفتابی", "دشت‌زی",
  "شن‌زار", "شوره‌زار", "سخت‌جان", "بادپا", "چشم‌روشن", "چشم‌تیز", "کمین‌گر",
  "برق‌آسا", "سرکش", "شاهوار", "یزدان‌گونه", "آرام‌جان", "توفانی", "مهربان", "سیاه‌چشم",
  "زرچشم", "آتش‌چشم", "سردخو", "گرمخو", "بارانی", "خشک‌زی", "تیره", "روشن", "پرابهت", "خیره‌کننده",
  "ستاره‌ای", "ماه‌گون", "خورشیدی", "تاریک", "کهکشانی", "بیدار", "خرسند", "خندان", "یورش‌گر", "پرتلاش",
  "فناناپذیر", "شاد", "غمگین", "تنها", "گمشده", "پیداشونده", "وفادار", "چالاک", "دیرپا", "راه‌رو", "کم‌حرف", "زیردریایی",
  "آرام‌راه", "چشم‌سیر", "درنده", "بال‌گشوده", "بالنده", "دورپرواز", "نزدیک‌رو", "سبک‌بال", "سنگین‌بال",
  "جادویی", "ناپیدا", "پرتابنده", "برکشیده", "لانه‌ساز", "صحراگرد", "گلگون", "سیمرغ‌وار", "عقاب‌گون", "شاهین‌خو",
  "نیرومند", "توانا", "پرتوان", "خردمند", "هوشیار", "چشم‌بان", "تیغ‌دار", "خارپشت‌گونه", "جنگلی", "زارعی",
  "چمن‌زی", "شب‌رو", "روزرو", "شکارچی", "سرنوشت‌ساز", "بادآور", "گریزپا", "پرغرور", "پرافتخار", "گرد", "خوش‌رنگ",
  "پرآواز", "پرآسا", "پرفریب", "کمین‌زده", "پرافسانه", "بی‌گمان", "خموش", "فریبنده", "توفان‌خیز", "دریافت‌گر",
  "آزاد", "سرمست", "دلنواز", "دریاباش", "شاداب", "جوان", "نیرنگ‌ناپذیر", "موج‌سوار", "نسیم‌گونه", "تندبادگون", "پویا",
  "آهسته", "سرافراز", "پرتوان", "نیرومند", "خیره‌چشم", "شادی‌آفرین",
];

const animals = [
  "گرگ", "روباه", "خرس", "پلنگ", "یوز", "ببر", "شیر", "شوکا", "گوزن", "آهو",  "کفتار", "شغال", "سگ‌وحشی", "سنجاب", "سمور",
  "راسو", "کوسه", "نهنگ", "دلفین", "لاک‌پشت", "مار", "افعی", "کبری", "پایتون", "مارمولک", "سوسمار", "تمساح", "قورباغه",
  "لاک‌پشت", "لک‌لک", "درنای", "کلاغ", "زاغ", "زاغچه", "عقاب", "شاهین", "باز", "قرقی", "بوته‌زی", "جغد",
  "جغد", "هما", "کرکس", "حواصیل", "اردک", "غاز", "قو", "مرغابی", "چکاوک", "گنجشک", "بلبل", "قمری", "فاخته", "کبوتر", "طاووس",
  "مرغ عشق", "مرغ مینا", "پرستو", "زنبور", "مورچه", "پروانه", "شب‌پره", "شب‌تاب", "خرچنگ", "اختاپوس", "ماهی",
  "مرجان", "اسب", "شتر", "شترمرغ", "بزکوهی", "مارال", "روباه", "گرگ",
  "خرگوش", "جوجه‌تیغی", "خارپشت", "خفاش", "سمورها", 
  "فیل", "کرگدن", "اسب آبی", "کوالا", "کانگورو", "پاندا", "خرس قطبی", "خرس قهوه‌ای",
  "بوفالو", "مرغ ماهی‌خوار", "دریاماهـی", "تیغ‌ماهی", "گربه",
  "گلدفیش", "توکان", "فلامینگو", "فک", "کُندرو", "شیر", "خرچنگ", "عنکبوت",
  "رتیل", "اسکورپیون", "موریانه", "حلزون", "صدف", "اسب", "شانه‌دار", "پرنده", "سیمرغ", "اژدها", "ققنوس",
  "آهو کوهی", "نهنگ", "کوسه", "گربه‌ماهی", "پنگوئن", "مرغ", "جوجه", "قناری", "فنچ",
];

async function hashToNumber(input: string): Promise<number> {
  const hash = await sha256(input)
  return parseInt(hash.slice(0, 16), 16);
}

async function sha256(text: string) {
  const encoder = new TextEncoder();
  const data = encoder.encode(text);
  const hashBuffer = await crypto.subtle.digest("SHA-256", data);
  const hashArray = Array.from(new Uint8Array(hashBuffer));
  return hashArray.map(b => b.toString(16).padStart(2, "0")).join("");
}

export async function nicknameFromIP(ip: string):Promise<string> {
  const h = await hashToNumber(ip);

  const adj = adjectives[h % adjectives.length];
  const ani = animals[ h % animals.length];

  return `${ani} ${adj}`;
}
